src/test/resources/data/test.xml

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"  xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"  xmlns:prt="prt:service:com.sapportals.portal.prt.webservice.usermanagement.UMWebService"><soapenv:Header/><soapenv:Body><prt:getUser soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><getUser_1_param2 xsi:type="xsd:string">jay.lightburne@quiksilver.com</getUser_1_param2></prt:getUser></soapenv:Body></soapenv:Envelope>